app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE LOWER('%%'))
SELECT "products".* FROM "products"
---
  def index
    @products = if params[:search]
      Product.where("LOWER(name) LIKE LOWER(?)", "%#{params[:search]}%")
    else
      Product.all

INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Coffee"], ["description", "Dark roast"], ["price_in_cents", 200], ["created_at", "2016-04-13 00:35:59.963446"], ["updated_at", "2016-04-13 00:35:59.963446"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save